"Close" = "Zavřít";

"Scan Card" = "Naskenovat kartu";

"Scan card" = "Naskenovat kartu";

"The IBAN you entered is invalid." = "Číslo IBAN, které jste zadali, je neplatné.";

"There was an error processing your card -- try again in a few seconds" = "Při zpracování Vaší karty došlo k chybě -- zkuste to za několik sekund znovu";

"There was an unexpected error -- try again in a few seconds" = "Došlo k neočekávané chybě -- zkuste to znovu za několik sekund";

"Try again" = "Zkusit znovu";

"We use Stripe to verify your card details. Stripe may use and store your data according its privacy policy. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Learn more</u></a>" = "K ověření údajů o vaší kartě používáme službu Stripe. Společnost Stripe může vaše údaje používat a ukládat v souladu se svými zásadami ochrany osobních údajů. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Více informací</u></a>";

"Your card has expired" = "Platnost Vaší karty uplynula";

"Your card was declined" = "Vaše karta byla odmítnuta";

"Your card's expiration month is invalid" = "Měsíc konce platnosti Vaší karty je neplatný";

"Your card's expiration year is invalid" = "Rok konce platnosti Vaší karty je neplatný";

"Your card's number is invalid" = "Číslo Vaší karty je neplatné";

"Your card's security code is invalid" = "Bezpečnostní kód Vaší karty je neplatný";

"Your name is invalid." = "Vaše jméno je neplatné.";

"Your payment method was declined." = "Vaše platební metoda byla zamítnuta.";
